{
    "name" : "Rashel Rojas",
    "university" : "Columbia University",
    "about_yourself" : "I'm a rising senior studying Computer Science with a track in Software Systems at Columbia University. I'm interested in Software Engineering - specifically, backend development.",
    "education" : [
        {
            "type" : "University", 
            "name" : "Columbia University",
            "gpa"  : "3.5",
            "duration" : "2019 - 2023"
        },
        {
            "type" : "High School", 
            "name" : "Bronx Science",
            "gpa"  : "95/100",
            "duration" : "2015 - 2019"
        }
    ],
    "experiences" : [
        {
            "position"   : "MLH Fellow",
            "company"    : "MLH",
            "location"   : "Remote",
            "start_date" : "May 2022",
            "end_date"   : "August 2022",
            "responsibilities" : [
                {
                    "resp_1" : "Created a portfolio web app using Flask, JavaScript, HTML, CSS"
                }
            ]
        },
        {
            "position"   : "Technical Summer Analyst",
            "company"    : "Goldman Sachs",
            "location"   : "Dallas, TX",
            "start_date" : "June 2021",
            "end_date"   : "August 2021",
            "responsibilities" : [
                {
                    "resp_1" : "Optimized storage system of a pre-trade analysis tool called Troodon, which generates and stores Bond Analysis Worksheets (BAWs) into a local folder used by the CLO Secondary Trading desk of 15 traders",
                    "resp_2" : "Created a Procmon script in Slang (GS proprietary language) to transfer BAWs older than 2 years from local to cloud storage in Goldman Sachs’ main cloud storage system, OBS2",
                    "resp_3" : "Successful in freeing up hundreds of gigabytes of space, which came at a crucial time considering local storage was at 90% capacity and the recent uptick in CLO trading"
                }
            ]
        },
        {
            "position"   : "Software Engineering Intern",
            "company"    : "Red Hat",
            "location"   : "Boston, MA",
            "start_date" : "May 2020",
            "end_date"   : "August 2020",
            "responsibilities" : [
                {
                    "resp_1" : "Worked under Babak Mozaffari on a team of 13 software engineers on the development of OpenShift / Kubernetes operators for Red Hat and upstream open-source products",
                    "resp_2" : "Implemented CR/CRD validation and ConsoleLink creation for 5 operators (3scale, Teiid, Apicurio, Hawtio, Syndesis) using Go and verified operator deployment via the OpenShift Container Platform"
                }
            ]
        }
    ],
    "hobbies" : [
        {
            "image" : "gym.jpg",
            "hobby" : "Working Out",
            "description" : "I work out 4-5 times a week with my sister at our local gym. I love it because I feel accomplished knowing that I'm doing something good for my body."
        },
        {
            "image" : "videogames.jpeg",
            "hobby" : "Dance",
            "description" : "I'm no professional but I really enjoy salsa, merengue, and bellydancing."
        }
    ]
}
